W6D2/first_routes_and_controllers/first_routes/app/controllers/artworks_controller.rb

  def index
    # render json: Artwork.all

    if params[:user_id]
      artwork = Artwork
        .left_outer_joins(:shares)
        .where('(artworks.artist_id = :user_id) OR (artwork_shares.viewer_id = :user_id)', user_id: params[:user_id])
        .distinct
    else
      artwork = Artwork.all
---
SELECT DISTINCT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE ((artworks.artist_id = '2') OR (artwork_shares.viewer_id = '2'))