W6D2/first_routes_and_controllers/first_routes/app/controllers/comments_controller.rb

  def index
    # render json: Artwork.all
    if params[:user_id]
        comment = Comment.where(user_id: params[:user_id])
    elsif params[:artwork_id]
        comment = Comment.where(artwork_id: params[:artwork_id])
    else
        comment = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 2], ["artwork_id", 3], ["body", "trash"], ["created_at", "2020-12-30 22:27:43.785246"], ["updated_at", "2020-12-30 22:27:43.785246"]]