W6D2/first_routes_and_controllers/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = params[:id]

        render json: User.find(user)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Kyle"], ["email", "kyle@gmail.com"], ["updated_at", "2020-12-29 23:07:53.147405"], ["id", 1]]
---
    def update
        user = User.find(params[:id])

        user.update(user_params)