W7D2/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "is_live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "MyBandsFirstAlbum"], ["year", 3000], ["band_id", 1], ["is_live", true], ["created_at", "2021-01-05 22:02:28.777013"], ["updated_at", "2021-01-05 22:02:28.777013"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "newtitle"], ["updated_at", "2021-01-05 22:38:50.121049"], ["id", 1]]
---
  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)