W7D2/music_app/app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "is_bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "song1"], ["ord", 1], ["lyrics", "hi hi hi hi"], ["album_id", 2], ["is_bonus", true], ["created_at", "2021-01-05 23:28:17.282855"], ["updated_at", "2021-01-05 23:28:17.282855"]]

  def update
    @track = Track.find(params[:id])
    if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["title", "editedsong"], ["updated_at", "2021-01-05 23:33:16.376375"], ["id", 2]]