W7D2/music_app/app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 3]]
---
<h2>Notes</h2>
<% @track.notes.each do |note| %>